spec/cassettes/Create_Payment_On_Success_Charge/creates_a_payment_associated_with_a_user.yml

---
http_interactions:
- request:
    method: get
    uri: https://api.stripe.com/v1/events/evt_15925gFgKcqrRTFpzQJDS1v7
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.16.0
      Authorization:
      - Bearer sk_test_Dcc34mbp2qICW467RU70g43W
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.16.0","lang":"ruby","lang_version":"2.1.4 p265 (2014-10-27)","platform":"x86_64-darwin13.0","publisher":"stripe","uname":"Darwin
        a-atwals-imac 13.4.0 Darwin Kernel Version 13.4.0: Sun Aug 17 19:50:11 PDT
        2014; root:xnu-2422.115.4~1/RELEASE_X86_64 x86_64"}'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Sat, 13 Dec 2014 01:01:45 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '1839'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_Jjj6kAIsLC9AyfSe
      Stripe-Version:
      - '2014-11-05'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "evt_15925gFgKcqrRTFpzQJDS1v7",
          "created": 1418424052,
          "livemode": false,
          "type": "charge.succeeded",
          "data": {
            "object": {
              "id": "ch_15925gFgKcqrRTFpVy8WJW4S",
              "object": "charge",
              "created": 1418424052,
              "livemode": false,
              "paid": true,
              "amount": 999,
              "currency": "gbp",
              "refunded": false,
              "captured": true,
              "refunds": {
                "object": "list",
                "total_count": 0,
                "has_more": false,
                "url": "/v1/charges/ch_15925gFgKcqrRTFpVy8WJW4S/refunds",
                "data": []
              },
              "card": {
                "id": "card_15925eFgKcqrRTFpRkKFQT79",
                "object": "card",
                "last4": "4242",
                "brand": "Visa",
                "funding": "credit",
                "exp_month": 12,
                "exp_year": 2014,
                "fingerprint": "DgDX42sUUB2CWCll",
                "country": "US",
                "name": null,
                "address_line1": null,
                "address_line2": null,
                "address_city": null,
                "address_state": null,
                "address_zip": null,
                "address_country": null,
                "cvc_check": "pass",
                "address_line1_check": null,
                "address_zip_check": null,
                "dynamic_last4": null,
                "customer": "cus_5JfQ36ppdP5h1H"
              },
              "balance_transaction": "txn_15925gFgKcqrRTFpFZ15pfZx",
              "failure_message": null,
              "failure_code": null,
              "amount_refunded": 0,
              "customer": "cus_5JfQ36ppdP5h1H",
              "invoice": "in_15925gFgKcqrRTFpcFgKoiO3",
              "description": null,
              "dispute": null,
              "metadata": {},
              "statement_description": "MyFliX Base",
              "fraud_details": {},
              "receipt_email": null,
              "receipt_number": null,
              "shipping": null
            }
          },
          "object": "event",
          "pending_webhooks": 0,
          "request": "iar_5JfQanMRLqxUMj",
          "api_version": "2014-11-05"
        }
    http_version: 
  recorded_at: Sat, 13 Dec 2014 01:01:44 GMT
recorded_with: VCR 2.9.3
